Tekla Open API Reference for Tekla Structures 2025
AssemblyDrawing Constructor
Overload List
Name | Description
AssemblyDrawing(Identifier)
 Instantiates a new assembly drawing with standard attributes.
AssemblyDrawing(Identifier, Int32)
 Instantiates a new assembly drawing with standard attributes and with a specified sheet number.
AssemblyDrawing(Identifier, String)
 Instantiates a new assembly drawing with given attributes.
AssemblyDrawing(Identifier, Int32, String)
 Instantiates a new assembly drawing with given attributes and with a specified sheet number.
Top
See Also
Reference
AssemblyDrawing Class
Tekla.Structures.Drawing Namespace